# YDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Ellipse..::..YDirection Property
Ellipse Class See Also
---
The Y direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public XYZ YDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property YDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ YDirection {
	XYZ^ get ();
}
```

# See Also
Ellipse Class
Autodesk.Revit.DB Namespace